[
  {
    "author": "UNH0LYM0NK • 6d ago",
    "content": "Theres a flag?",
    "upvotes": 8,
    "opinion": "neutral"
  },
  {
    "author": "spicy_capybara • 6d ago",
    "content": "Right? I’m not sure waving a flag for a disorder is really the way to go. Especially since HS is shared by all sexuality’s including straight.",
    "upvotes": 11,
    "opinion": "oppose"
  },
  {
    "author": "textposts_only • 6d ago",
    "content": "Asexuality and transgender is also shared by all sexualities including straight",
    "upvotes": 1,
    "opinion": "neutral"
  },
  {
    "author": "Topperno • 5d ago",
    "content": "Yeah but being transgender is a genderqueer identity and asexuals are also an uncommon sexuality. Being cis het is not queer.",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "textposts_only • 5d ago",
    "content": "How is asexual a sexuality? Aces can still be straight or gay or what have you. There are varying degrees of asexuality. And i mentioned trans people because the poster above me did. It's simple, either we gatekeep the queer banner (stupid idea) or we let in people who are marginalized due to something they're either born with or identify with in regards to their sexuality or gender. I.e. aces, hypersexuality, queer ppl etc",
    "upvotes": 1,
    "opinion": "support"
  },
  {
    "author": "Topperno • 4d ago",
    "content": "Ah sex addiction is a queer identity. Got it.",
    "upvotes": 0,
    "opinion": "oppose"
  },
  {
    "author": "textposts_only • 4d ago",
    "content": "That's disrespectful.",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "Topperno • 4d ago",
    "content": "You said it not me. Also have you ever read the description of this subreddit. It refers to hypersexuality as sex addiction.",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "textposts_only • 4d ago",
    "content": "If you boil anything down to it's essentials, however right or not, it sounds insulting. Asexuals? Since when is not wanting to Fuck a sexuality Transgender? Since when is being another gender than the one you're mistakenly assigned with a sexuality!",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "Topperno • 4d ago • Edited 4d ago",
    "content": "Bruh. Hypersexuality, sex addiction and compulsive sexual disorder are all used by the health professionals who deal with this shit. Imagine not understanding what asexuality is but using it to make a point. Imagine not understand that LGBT is for queer sexualities and genders.",
    "upvotes": 1,
    "opinion": "support"
  },
  {
    "author": "Lillian_the_flower • 6d ago • Edited 6d ago",
    "content": "Hs is not a gender identity or sexuality so idk why it would be part of lgbtq+. Hs is a mental disorder. There's definitely more acceptance and understanding needed and ppl need to judge it less but if you add it to a pride flag then you might as well add a flag for ocd or depression or 1000 other things that will eventually drown out the lgbtq stuff I wouldn't include it personally, it feels like the only reason they're even lumped in is because \"sexuality\" in in the name. It doesn't rrally have anything to do with lgbtq stuff imo",
    "upvotes": 9,
    "opinion": "oppose"
  },
  {
    "author": "Key_Computer_4348 • 6d ago",
    "content": "Pretty much every gender identity or sexuality was considered a mental disorder until it wasn't, tbf. Gay was considered a mental disorder, trans was considered a mental disorder. They weren't considered legit sexualities or identities. And before anyone says \"yes but hypersexuality is bad for you!\", like you don't think being a gay man in 1955 was bad for your physical and mental well-being? Gay is not a mental disorder, it's just how society treated it that made it detrimental to oneself.",
    "upvotes": 7,
    "opinion": "support"
  },
  {
    "author": "Lillian_the_flower • 6d ago",
    "content": "Just what do you think hs is? The only negative that came from being gay were due to society. Society can change however it wants and the compulsive and self destructive behavior of hs will still be bad. Hs doesn't mean high libido",
    "upvotes": 2,
    "opinion": "neutral"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "People would have said the exact same thing about a myriad of different sexualities and identities before. They would have said that it's compulsive and self destructive and tons of other negative things. Hypersexuality is most harmful because acting out the needs you have is met with hostility by society. If you're a woman with an extremely high libido who seeks out multiple partners, more than what is \"normal\", you're seen as damaged goods and crazy. If you were hypersexual in a society that actually accepted sexuality and its needs, it wouldn't be nearly as bad as it can be now. And no, hs isn't just \"high libido\", it's more complicated than that, but like other identities it's something you can't change and which is made the worst in the experience by a puritan society that sees sexuality as suspicious.",
    "upvotes": 2,
    "opinion": "support"
  },
  {
    "author": "Lillian_the_flower • 5d ago",
    "content": "You can't agree that hs isn't just high libido and then talk about it as if it was just high libido. The problem with hs is that you feel COMPULSED to act on it despite any harm that it causes you. That harm can have nothing to do with society. Literally your entire comment talks about if we just accepted that people could fuck a lot, everything would be fine. You're the type of person that pretends hs is just high libido lol. You CAN change it! That's why people go into therapy and get medicated for. Like what are you even talking about. By telling people they can't change it you're trying to move them away from seeking help, why would you do that just to pretend like hs is a harmless personality quirk",
    "upvotes": 1,
    "opinion": "neutral"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "You CAN change it! That's why people go into therapy and get medicated for. Like what are you even talking about. Nah. You can repress it, but that's not the same as change it. There's no cure for being hypersexual, just as there isn't any cure for any sexuality. You can try and shove it down into silence with drugs and psychological methods, but that doesn't mean it's gone. It's pretty icky to me that you're like \"nooo you can't have a different perspective you must be pretending to be hs!\" I'd tell you about my own personal history and experiences and why I 100% know what I'm talking about, but not gonna divulge that in public. The harm that is caused by those compulsive feelings is very correlated to what society thinks and how it reacts to our actions. If you have an overwhelming compulsion to go out and do things that explicitly harm you, like puts your physical safety at serious risk, that's not just hypersexuality, that's hypersexuality plus something else, and mostly something else.",
    "upvotes": 2,
    "opinion": "neutral"
  },
  {
    "author": "Lillian_the_flower • 5d ago",
    "content": "Show me where I said you're pretending to have hs? You're pretending that it is equivalent to having high libido or that it's just like being gay. No amount of therapy or medication will stop you from being gay. There ARE effective treatments and therapy that can help people to deal with their compulsions and better manage them for the rest of their life. Pretending like there aren't because you want hs to be the same as being gay is just incredibly selfish.",
    "upvotes": -1,
    "opinion": "oppose"
  },
  {
    "author": "[deleted] • 5d ago",
    "content": "So what do you think? They were correct back then and you can medicate yourself out of being gay? Or that they are wrong now and all the people here who are helped through therapy are just placebos? Just because they used to be wrong doesn't mean you never trust doctors again lol especially when I am alive because of the medication I got for hs",
    "upvotes": null,
    "opinion": "neutral"
  },
  {
    "author": "Lillian_the_flower • 5d ago",
    "content": "So what do you think? They were correct back then and you can medicate yourself out of being gay? Or that they are wrong now and all the people here who are helped through therapy are just placebos? Just because they used to be wrong doesn't mean you never trust doctors again lol especially when I am alive because of the medication I got for hs",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "[deleted] • 5d ago",
    "content": "",
    "upvotes": null,
    "opinion": "neutral"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "No amount of therapy or medication will stop you from being gay And no amount of therapy or medication will stop you from being hypersexual either. All it will do is dull you, it can't carve out a part of who you are. Drugs can tranquilize anyone down to the point where they are too numb to even feel, or they can impose themselves to disrupt your endocrine system, but at the end of the day, you are still you. With the drugs, now you're just buried beneath them. You're being very inconsiderate and rude with the implication that I \"want hs to be the same as being gay\". You know that's a disingenuous thing to say, because you know what I've been trying to say here and I am far from the first gal to say it. What makes hypersexuality so much worse is the same thing that has made other marginalized sexualities, such as being gay, much worse, which is our inheritance of a fundamentalist Christian world which viewed anything sexual as sinful and \"against God\". Barely 100 years ago, women were diagnosed (yes, literally clinically diagnosed by doctors and other professionals) as having being mentally ill with what they called \"hysteria\" because they had sexual desires or were inclined towards promiscuity. Women were and still are socially ostracized and mocked and bullied for the same thing still to this day. Note how that happened only to women, never to men. I really hope you do read this, and not just skim it so you can argue on the internet, because I think there's a good chance you've internalized the same fundamentalist religious and patriarchal viewpoints as I've just been describing. Sexuality is not a sickness. Being constantly horny is not a sickness. The only way it becomes a sickness is if you have strong compulsions to do things that put you in harms way, and you don't need hypersexuality to get you there either.",
    "upvotes": 1,
    "opinion": "neutral"
  },
  {
    "author": "Lillian_the_flower • 5d ago",
    "content": "Idk why you're trying to talk about the therapy when you clearly have no idea about it. There are coping mechanisms and mental strategies you can learn to deal with hs compulsions. There's medication that can help you without making you a zombie. I'd say look it up but since you will write off any modern medicine because 100 years ago they gave you coke for headaches ... what is the point? Also nice accusing me of being disingenuous and then writing everything I say off as just trying to win an online argument. I can tell you're super interested in a real conversation. Im happy that you cant fathom that hs comes with real mental problems that are not caused by society and will not be fixed by society. But hs is not equal to high libido and everything you said is just about people being judged for sleeping around a lot. Its just not what hs means. I can't link you the definition because you will just write it off so idk what else there is to talk about. I just think its disgusting to come to a hs support space and discourage people from seeking help by painting the available treatment as negative as you do and gaslighting people that all their issues are from society and that they shouldn't work to fix them.",
    "upvotes": 3,
    "opinion": "neutral"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "Nah. I've gone to therapy a lot and it can be super useful. Maybe you should ask first instead of assuming? I also like drugs, both over the counter and uhh under it lol. Anyway, you're just really not listening, which is sad, because I really do think you've someone been convinced and probably still convince yourself that you're broken. Could've been nice to actually talk about this, but you didn't even address what I said at all about how society has made life shit for women and their sexuality both historically and contemporarily, which is actually a pretty important point that you should pay attention to, so idk ig there's just no way of getting through to you and having an actual conversation. I said many times that hs is not just high libido. Ik this, because I'm hs. All you do is assume and put words in my mouth. Ik the definition. No, I don't write off modern medicine. I'm a trans woman with over 4 years on HRT, trust me I love modern medicine lol. You really need to get better at listening to other people instead of just forming an unbreakable opinion based on your own worst-take guesswork.",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "Topperno • 5d ago",
    "content": "Except the issue is that most people who struggle with hypersexuality is men and most men are not shamed for being sexual or watching a lot of porn or masturbating or having sex with multiple people. In fact society and people are generally overtly sexual and it's okay for them. Hypersexuality is not the same as being shamed for being gay and treated like an other. Hypersexuality is inward emotions coming from a compulsion that one cannot control themselves. I hate this comparison to actual lgbt identities. Like fuck off.",
    "upvotes": 0,
    "opinion": "oppose"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "Except the issue is that most people who struggle with hypersexuality is men and most men are not shamed for being sexual or watching a lot of porn or masturbating or having sex with multiple people. In fact society and people are generally overtly sexual and it's okay for them. Uhh, yes, exactly? Meaning that how society treats us hugely changes how hypersexuality is experienced? It shows that as an example, it can be much harder for women because society doesn't accept it. This is really going over some of yalls heads lol.",
    "upvotes": 0,
    "opinion": "support"
  },
  {
    "author": "Topperno • 5d ago",
    "content": "The description for this subreddit refers to hypersexuality as sex addiction i.e sexual compulsion. You should do some research on the negative effects of sexual compulsion on people that is not entirely caused by society before you start speaking from a place of \"education\".",
    "upvotes": 0,
    "opinion": "neutral"
  },
  {
    "author": "Key_Computer_4348 • 5d ago",
    "content": "I know what the negative effects of sexual compulsion are. Do you? Because most of those negative effects are negative as a consequence of societal rejection.",
    "upvotes": 0,
    "opinion": "support"
  }
]