[
    {
        "author": "UNH0LYM0NK • 6d ago",
        "content": "Theres a flag?",
        "upvotes": 8
    },
    {
        "author": "spicy_capybara • 6d ago",
        "content": "Right? I’m not sure waving a flag for a disorder is really the way to go. Especially since HS is shared by all sexuality’s including straight.",
        "upvotes": 11
    },
    {
        "author": "textposts_only • 6d ago",
        "content": "Asexuality and transgender is also shared by all sexualities including straight",
        "upvotes": 1
    },
    {
        "author": "Topperno • 5d ago",
        "content": "Yeah but being transgender is a genderqueer identity and asexuals are also an uncommon sexuality. Being cis het is not queer.",
        "upvotes": 0
    },
    {
        "author": "textposts_only • 5d ago",
        "content": "How is asexual a sexuality? Aces can still be straight or gay or what have you. There are varying degrees of asexuality. And i mentioned trans people because the poster above me did. It's simple, either we gatekeep the queer banner (stupid idea) or we let in people who are marginalized due to something they're either born with or identify with in regards to their sexuality or gender. I.e. aces, hypersexuality, queer ppl etc",
        "upvotes": 1
    },
    {
        "author": "Topperno • 4d ago",
        "content": "Ah sex addiction is a queer identity. Got it.",
        "upvotes": 0
    },
    {
        "author": "textposts_only • 4d ago",
        "content": "That's disrespectful.",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago",
        "content": "You said it not me. Also have you ever read the description of this subreddit. It refers to hypersexuality as sex addiction.",
        "upvotes": 0
    },
    {
        "author": "textposts_only • 4d ago",
        "content": "If you boil anything down to it's essentials, however right or not, it sounds insulting. Asexuals? Since when is not wanting to Fuck a sexuality Transgender? Since when is being another gender than the one you're mistakenly assigned with a sexuality!",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago • Edited 4d ago",
        "content": "Bruh. Hypersexuality, sex addiction and compulsive sexual disorder are all used by the health professionals who deal with this shit. Imagine not understanding what asexuality is but using it to make a point. Imagine not understand that LGBT is for queer sexualities and genders.",
        "upvotes": 1
    },
    {
        "author": "Lillian_the_flower • 6d ago • Edited 6d ago",
        "content": "Hs is not a gender identity or sexuality so idk why it would be part of lgbtq+. Hs is a mental disorder. There's definitely more acceptance and understanding needed and ppl need to judge it less but if you add it to a pride flag then you might as well add a flag for ocd or depression or 1000 other things that will eventually drown out the lgbtq stuff I wouldn't include it personally, it feels like the only reason they're even lumped in is because \"sexuality\" in in the name. It doesn't rrally have anything to do with lgbtq stuff imo",
        "upvotes": 9
    },
    {
        "author": "Key_Computer_4348 • 6d ago",
        "content": "Pretty much every gender identity or sexuality was considered a mental disorder until it wasn't, tbf. Gay was considered a mental disorder, trans was considered a mental disorder. They weren't considered legit sexualities or identities. And before anyone says \"yes but hypersexuality is bad for you!\", like you don't think being a gay man in 1955 was bad for your physical and mental well-being? Gay is not a mental disorder, it's just how society treated it that made it detrimental to oneself.",
        "upvotes": 7
    },
    {
        "author": "Lillian_the_flower • 6d ago",
        "content": "Just what do you think hs is? The only negative that came from being gay were due to society. Society can change however it wants and the compulsive and self destructive behavior of hs will still be bad. Hs doesn't mean high libido",
        "upvotes": 2
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "People would have said the exact same thing about a myriad of different sexualities and identities before. They would have said that it's compulsive and self destructive and tons of other negative things. Hypersexuality is most harmful because acting out the needs you have is met with hostility by society. If you're a woman with an extremely high libido who seeks out multiple partners, more than what is \"normal\", you're seen as damaged goods and crazy. If you were hypersexual in a society that actually accepted sexuality and its needs, it wouldn't be nearly as bad as it can be now. And no, hs isn't just \"high libido\", it's more complicated than that, but like other identities it's something you can't change and which is made the worst in the experience by a puritan society that sees sexuality as suspicious.",
        "upvotes": 2
    },
    {
        "author": "Lillian_the_flower • 5d ago",
        "content": "You can't agree that hs isn't just high libido and then talk about it as if it was just high libido. The problem with hs is that you feel COMPULSED to act on it despite any harm that it causes you. That harm can have nothing to do with society. Literally your entire comment talks about if we just accepted that people could fuck a lot, everything would be fine. You're the type of person that pretends hs is just high libido lol. You CAN change it! That's why people go into therapy and get medicated for. Like what are you even talking about. By telling people they can't change it you're trying to move them away from seeking help, why would you do that just to pretend like hs is a harmless personality quirk",
        "upvotes": 1
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "You CAN change it! That's why people go into therapy and get medicated for. Like what are you even talking about. Nah. You can repress it, but that's not the same as change it. There's no cure for being hypersexual, just as there isn't any cure for any sexuality. You can try and shove it down into silence with drugs and psychological methods, but that doesn't mean it's gone. It's pretty icky to me that you're like \"nooo you can't have a different perspective you must be pretending to be hs!\" I'd tell you about my own personal history and experiences and why I 100% know what I'm talking about, but not gonna divulge that in public. The harm that is caused by those compulsive feelings is very correlated to what society thinks and how it reacts to our actions. If you have an overwhelming compulsion to go out and do things that explicitly harm you, like puts your physical safety at serious risk, that's not just hypersexuality, that's hypersexuality plus something else, and mostly something else.",
        "upvotes": 2
    },
    {
        "author": "Lillian_the_flower • 5d ago",
        "content": "Show me where I said you're pretending to have hs? You're pretending that it is equivalent to having high libido or that it's just like being gay. No amount of therapy or medication will stop you from being gay. There ARE effective treatments and therapy that can help people to deal with their compulsions and better manage them for the rest of their life. Pretending like there aren't because you want hs to be the same as being gay is just incredibly selfish.",
        "upvotes": -1
    },
    {
        "author": "[deleted] • 5d ago",
        "content": "So what do you think? They were correct back then and you can medicate yourself out of being gay? Or that they are wrong now and all the people here who are helped through therapy are just placebos? Just because they used to be wrong doesn't mean you never trust doctors again lol especially when I am alive because of the medication I got for hs",
        "upvotes": null
    },
    {
        "author": "Lillian_the_flower • 5d ago",
        "content": "So what do you think? They were correct back then and you can medicate yourself out of being gay? Or that they are wrong now and all the people here who are helped through therapy are just placebos? Just because they used to be wrong doesn't mean you never trust doctors again lol especially when I am alive because of the medication I got for hs",
        "upvotes": 0
    },
    {
        "author": "[deleted] • 5d ago",
        "content": "",
        "upvotes": null
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "No amount of therapy or medication will stop you from being gay And no amount of therapy or medication will stop you from being hypersexual either. All it will do is dull you, it can't carve out a part of who you are. Drugs can tranquilize anyone down to the point where they are too numb to even feel, or they can impose themselves to disrupt your endocrine system, but at the end of the day, you are still you. With the drugs, now you're just buried beneath them. You're being very inconsiderate and rude with the implication that I \"want hs to be the same as being gay\". You know that's a disingenuous thing to say, because you know what I've been trying to say here and I am far from the first gal to say it. What makes hypersexuality so much worse is the same thing that has made other marginalized sexualities, such as being gay, much worse, which is our inheritance of a fundamentalist Christian world which viewed anything sexual as sinful and \"against God\". Barely 100 years ago, women were diagnosed (yes, literally clinically diagnosed by doctors and other professionals) as having being mentally ill with what they called \"hysteria\" because they had sexual desires or were inclined towards promiscuity. Women were and still are socially ostracized and mocked and bullied for the same thing still to this day. Note how that happened only to women, never to men. I really hope you do read this, and not just skim it so you can argue on the internet, because I think there's a good chance you've internalized the same fundamentalist religious and patriarchal viewpoints as I've just been describing. Sexuality is not a sickness. Being constantly horny is not a sickness. The only way it becomes a sickness is if you have strong compulsions to do things that put you in harms way, and you don't need hypersexuality to get you there either.",
        "upvotes": 1
    },
    {
        "author": "Lillian_the_flower • 5d ago",
        "content": "Idk why you're trying to talk about the therapy when you clearly have no idea about it. There are coping mechanisms and mental strategies you can learn to deal with hs compulsions. There's medication that can help you without making you a zombie. I'd say look it up but since you will write off any modern medicine because 100 years ago they gave you coke for headaches ... what is the point? Also nice accusing me of being disingenuous and then writing everything I say off as just trying to win an online argument. I can tell you're super interested in a real conversation. Im happy that you cant fathom that hs comes with real mental problems that are not caused by society and will not be fixed by society. But hs is not equal to high libido and everything you said is just about people being judged for sleeping around a lot. Its just not what hs means. I can't link you the definition because you will just write it off so idk what else there is to talk about. I just think its disgusting to come to a hs support space and discourage people from seeking help by painting the available treatment as negative as you do and gaslighting people that all their issues are from society and that they shouldn't work to fix them.",
        "upvotes": 3
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "Nah. I've gone to therapy a lot and it can be super useful. Maybe you should ask first instead of assuming? I also like drugs, both over the counter and uhh under it lol. Anyway, you're just really not listening, which is sad, because I really do think you've someone been convinced and probably still convince yourself that you're broken. Could've been nice to actually talk about this, but you didn't even address what I said at all about how society has made life shit for women and their sexuality both historically and contemporarily, which is actually a pretty important point that you should pay attention to, so idk ig there's just no way of getting through to you and having an actual conversation. I said many times that hs is not just high libido. Ik this, because I'm hs. All you do is assume and put words in my mouth. Ik the definition. No, I don't write off modern medicine. I'm a trans woman with over 4 years on HRT, trust me I love modern medicine lol. You really need to get better at listening to other people instead of just forming an unbreakable opinion based on your own worst-take guesswork.",
        "upvotes": 0
    },
    {
        "author": "Topperno • 5d ago",
        "content": "Except the issue is that most people who struggle with hypersexuality is men and most men are not shamed for being sexual or watching a lot of porn or masturbating or having sex with multiple people. In fact society and people are generally overtly sexual and it's okay for them. Hypersexuality is not the same as being shamed for being gay and treated like an other. Hypersexuality is inward emotions coming from a compulsion that one cannot control themselves. I hate this comparison to actual lgbt identities. Like fuck off.",
        "upvotes": 0
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "Except the issue is that most people who struggle with hypersexuality is men and most men are not shamed for being sexual or watching a lot of porn or masturbating or having sex with multiple people. In fact society and people are generally overtly sexual and it's okay for them. Uhh, yes, exactly? Meaning that how society treats us hugely changes how hypersexuality is experienced? It shows that as an example, it can be much harder for women because society doesn't accept it. This is really going over some of yalls heads lol.",
        "upvotes": 0
    },
    {
        "author": "Topperno • 5d ago",
        "content": "The description for this subreddit refers to hypersexuality as sex addiction i.e sexual compulsion. You should do some research on the negative effects of sexual compulsion on people that is not entirely caused by society before you start speaking from a place of \"education\".",
        "upvotes": 0
    },
    {
        "author": "Key_Computer_4348 • 5d ago",
        "content": "I know what the negative effects of sexual compulsion are. Do you? Because most of those negative effects are negative as a consequence of societal rejection.",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago",
        "content": "Yeah sure cause feeling the need to compulsively masturbate when anxious is to do with societal rejection. Having uncontrollable fantasies are societal rejection. Feeling consumed by fantasies are societal rejection.",
        "upvotes": 0
    },
    {
        "author": "Key_Computer_4348 • 4d ago",
        "content": "Masturbation is a common de-stress tool. Not just common, but harmless. Sexual fantasies are normal to have and yes, most people don't decide what they are, they're just there. Sounds more to me like you're dealing with the shame of having those desires and fantasies because it makes you feel like a freak, and that is because of societal norms of sexuality, yes.",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago • Edited 4d ago",
        "content": "Except when It's compulsive and unwanted. If It's not compulsive and unwanted It's not hypersexuality.",
        "upvotes": 0
    },
    {
        "author": "Key_Computer_4348 • 4d ago",
        "content": "Nobody controls when they get turned on. Obviously you can like \"schedule\" times when you want to deliberately turn yourself on ig, but arousal is usually spontaneous. I know hs isn't just \"you're horny a lot\". All I've been saying is that the condition of hypersexuality would be a lot better if society wasn't so puritanical. It makes the condition a lot worse because it makes people view themselves as freaks and compounds the condition with endless amounts of shame and self-loathing. If you can't understand that, there's nothing more to discuss.",
        "upvotes": 0
    },
    {
        "author": "Intercode001 • 5d ago",
        "content": "I feel like it's as much a \"sexuality\" as asexuality. Otherwise, what do you call asexuality? Also, some consider their hypersexuality to be an integral part of their identity, there's no question there. Language is what we make of it, that includes definitions, categories and usage.",
        "upvotes": 1
    },
    {
        "author": "Lillian_the_flower • 5d ago",
        "content": "Asexuality only tells you which people the person feels sexually attracted to -> nobody. It doesn't include any crippling mental issues that require treatment or cause immense mental distress. It also doesn't mean no libido. Just as hs doesn't just mean high libido",
        "upvotes": 2
    },
    {
        "author": "Other-Bumblebee2769 • 5d ago",
        "content": "It's obe thing to have a place to chat about this stuff... waving a flag for this is cringe af",
        "upvotes": 3
    },
    {
        "author": "bitchisakarma • 6d ago",
        "content": "Every group doesn't need a flag",
        "upvotes": 4
    },
    {
        "author": "ArrogjentMan • 5d ago • Edited 5d ago",
        "content": "Hyper-sexuality is like any other obsession/ addiction - gaming, alcohol, drug use, gambling. But also very different because it involves the entire body too and not just parts of it + the mind. So yes it can be as bad as the other things mentioned above, if they get out of hand. It can be used as an identity flag only as much as how one would use mental illnesses - OCD, Autism, ADHD, PTSD, SA trauma survivor etc. It does not need to be a pride flag or an identity flag, because it is not a sexual orientation or an identity, it is a condition/ disorder. It becomes a pride thing only when it is not accepted. Then we are forced to spread awareness about it and stand up for it with pride.",
        "upvotes": 4
    },
    {
        "author": "Storm141 • 5d ago",
        "content": "Lol",
        "upvotes": 2
    },
    {
        "author": "polskialt • 6d ago",
        "content": "accepting this pride flag would be supportive or potentially harmful to your community honestly, and it hurts to say it, I worry that when hypersexual people hook up there's a risk of things getting out of control. obviously not all the time, but the risk is there. Maybe making it easier to do that isn't the safest idea.",
        "upvotes": 3
    },
    {
        "author": "Topperno • 6d ago",
        "content": "Queer person here. Hypersexuality isn't a sexual or gender identity that's in the minority. It's a compulsive sexual behaviour that requires therapy or medical treatment. I think it would be disrespectful to queer identities to lump them in with mostly cis het people who struggle with being overly sexual in a way that effects their life.",
        "upvotes": 5
    },
    {
        "author": "ZookeepergameOne5236 • 6d ago",
        "content": "I agree. I'm bisexual and have been on Pride marches for the last cough years. Sexual and gender identity is different to compulsive and destructive behaviour. I view my HS the same way I do my alcoholism. A potentially destructive behaviour that I need to manage, not an aspect of my identity that is to be celebrated.",
        "upvotes": 6
    },
    {
        "author": "Topperno • 6d ago",
        "content": "Exactly this! Like there has been arguments over what exactly HS is but with more and recent research, it's been agreed upon that it is a form of compulsive behaviour with only negative effects. It does irk me a lot to see a lot of people on this subreddit who act like it's just having a high libido that is solved by having a lot of sex.",
        "upvotes": 4
    },
    {
        "author": "DumpsterFireOfLove • 6d ago",
        "content": "It does irk me a lot to see a lot of people on this subreddit who act like it's just having a high libido that is solved by having a lot of sex. Respectfully, this is your view, not everyone’s. Some people struggle with it, some people have accepted it. Some people are in situations where it’s a problem that is concerning, some people aren’t. It is not a one size fits all experience.",
        "upvotes": -1
    },
    {
        "author": "Topperno • 5d ago",
        "content": "Respectfully this is the view of medical professionals. If you do not have negative issues regarding your sexual behavior, that's a high sex drive not hypersexuality. Hypersexuality is also known as compulsive sexual behavior disorder, or more commonly, sex addiction. When a person has an obsessive fixation on sex, sexual acts, and sexual fantasies, they might be hypersexual. This fixation is typically so severe that it might disrupt a person’s daily functioning. Some research shows that up to 3% to 6% of people are living with some form of sexual addiction disorder or related disorders and that this condition predominantly affects men. A high sex drive is an increased sexual desire. On the other hand, hypersexuality involves out-of-control feelings and urges to have sex as well as high-frequency sexual behavior.",
        "upvotes": 1
    },
    {
        "author": "Lillian_the_flower • 6d ago",
        "content": "Yeah this is a good way to put it",
        "upvotes": 2
    },
    {
        "author": "DumpsterFireOfLove • 6d ago",
        "content": "Bi HS person weighing in here: Um, I’d like a flag. But I understand the issues that many (including myself) HS people face struggling with/accepting their hypersexuality. So I think there’s a should be a healthy debate about it. Also, my two cents: if the ACE/Aro identities are increasingly becoming an accepted part of the LGBTQ+ community, why not HS?",
        "upvotes": 4
    },
    {
        "author": "Topperno • 6d ago",
        "content": "Because hypersexuality is marked as compulsive sexual behavior that is only negative for their mental health by having unwanted sexual thoughts or engaging in unwanted sexual behaviour that a person cannot control or stop themselves from doing. It is not an identity. It also isn't inherently queer in that it doesn't say anything about who you are attracted to, only that you can't control your sexual behaviour or thoughts. Asexuality and aromantism are both an identity in that it communicate how one experiences or rather may not experience an attraction to others.",
        "upvotes": 3
    },
    {
        "author": "DumpsterFireOfLove • 6d ago",
        "content": "Yes, but you could also say the same for homosexuality, if we were having this debate back in the 70s. Homosexuality was classified as a mental illness in the DSM for a long time. And I take exception with what you’re saying about it only being a negative for someone’s mental health. Yes, it is a struggle, more so for some than for others, but yes. However, mostly a good part of that struggle is fitting into societies ideas of standard sexuality, just as many people struggled with their homosexual identity in the 70s, and still do today. If non-heterosexual identities were fully accepted in society, there would be no (or greatly lessened) struggle.",
        "upvotes": 1
    },
    {
        "author": "Topperno • 6d ago",
        "content": "Compulsive sexual behavior is sometimes called hypersexuality or sexual addiction. It's an intense focus on sexual fantasies, urges or behaviors that can't be controlled. This causes distress and problems for your health, job, relationships or other parts of your life. Compulsive sexual behavior may involve different kinds of commonly enjoyable sexual experiences. Examples include masturbation, sexual arousal by using a computer to communicate, multiple sexual partners, use of pornography or paying for sex. But when these sexual behaviors become a major, constant focus in your life, are difficult to control, cause problems in your life, or are harmful to you or others, that's likely compulsive sexual behavior. From the Mayo clinic. Symptoms Some signs that you may have compulsive sexual behavior include: You have repeated and intense sexual fantasies, urges, and behaviors that take up a lot of your time and feel as if they're beyond your control. You feel driven or have frequent urges to do certain sexual behaviors, feel a release of the tension afterward, but also feel guilt or deep regret. You've tried without success to reduce or control your sexual fantasies, urges or behavior. You use compulsive sexual behavior as an escape from other problems, such as loneliness, depression, anxiety or stress. You continue to engage in sexual behaviors in spite of them causing serious problems. These could include the possibility of getting or giving someone else a sexually transmitted infection, the loss of important relationships, trouble at work, financial issues, or legal problems. You have trouble making and keeping healthy and stable relationships. But sure this the same as being sexually attracted to the same gender or all genders or nobody at all.",
        "upvotes": 5
    },
    {
        "author": "DumpsterFireOfLove • 6d ago",
        "content": "Upvotes for the references, thank you. However, not all hypersexuality is considered compulsive sexual behavior. That’s my point. If your hypersexuality IS affecting your life negatively and is causing distress, that could be compulsive sexual behavior, and should be addressed. But if it’s NOT causing distress or problems in your life, then it is just another facet of who you are. Hypersexuality ≠ Compulsive Sexual Behavior.",
        "upvotes": 0
    },
    {
        "author": "John___Coyote • 5d ago",
        "content": "Hypersexuality = Compulsive Sexual Behavior. If sexual behavior not compulsive then ≠ hypersexuality. intrusive sexual thoughts under self control ≠hypersexual This post ≠ an attack or insult.",
        "upvotes": 3
    },
    {
        "author": "Topperno • 5d ago",
        "content": "All you're saying is you're not hypersexual and appropriating the term for your high sex drive/high libido. Kind of a shit thing to do and then turn around and try to soap box hypersexuality to people who actually suffer with it. Hypersexuality is in fact defined as compulsive sexual behaviour. The point is that it's normal sexual behaviour that is so perverse/time consuming/shame bringing that it ruins your mental health, physical health, personal relationships, work or education.",
        "upvotes": 2
    },
    {
        "author": "rockinvet02 • 6d ago",
        "content": "Are you going to include flags for all the mental health disorders or just this one?",
        "upvotes": 1
    },
    {
        "author": "Bessini • 6d ago",
        "content": "Not everything needs a flag",
        "upvotes": 0
    },
    {
        "author": "loyalsubjectbeliever • 6d ago",
        "content": "I think it deserves to be there as much as asexuality. Neither is an orientation so I can see why people may not want it there but at the same time both deserve validation and understanding. After all, is asexuality is the lack of sexuality, why including it in a group of flags dedicated to sexual orientations? It just feels, to me, like excluding it means we're less valid than other groups. Hell, some orientations even have multiple names and flags.",
        "upvotes": -3
    },
    {
        "author": "Topperno • 5d ago",
        "content": "Bruh. Imagine thinking a compulsive sexual disorder that causes real life issues is the same as a sexual identity ALSO asexuality is the lack of sexual attraction not sexuality and asexual people can still have a libido and enjoy sex. Maybe do a little bit more research before trying to compare the two.",
        "upvotes": -2
    },
    {
        "author": "loyalsubjectbeliever • 5d ago • Edited 5d ago",
        "content": "Imagine thinking that lack of sexual attraction is a sexual identity Not to mention that asexuality, homosexuality and transgender were considered illnesses too until they realized they weren't. Why are you being so aggressive?",
        "upvotes": 1
    },
    {
        "author": "Topperno • 4d ago",
        "content": "That sounds like something a straight person would say.",
        "upvotes": -2
    },
    {
        "author": "loyalsubjectbeliever • 4d ago",
        "content": "Try again, I'm bi",
        "upvotes": 2
    },
    {
        "author": "Topperno • 4d ago",
        "content": "Damn, I thought a queer person would have been less queerphobic but here we are.",
        "upvotes": 0
    },
    {
        "author": "loyalsubjectbeliever • 4d ago",
        "content": "I'm not queerphobic tho, and you're the one being aggressive as hell",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago",
        "content": "Imagine thinking that lack of sexual attraction is a sexual identity Not being \"queerphobic\" while saying asexuality isn't a sexual identity.",
        "upvotes": 0
    },
    {
        "author": "loyalsubjectbeliever • 4d ago",
        "content": "It's lack thereof I have literally nothing against asexuals but way I see it asexuality and hypersexuality are two sides of the same medal. If one belongs then the other should too and vice versa. Now, can we agree to disagree so you can leave me alone and stop being aggressive?",
        "upvotes": 0
    },
    {
        "author": "Topperno • 4d ago",
        "content": "Hypersexuality describes a person's inability to control their sexual behavior, arousal, impulses, or urges to the point of causing distress in their personal, work, or school life. Healthcare professionals may also refer to hypersexuality as: compulsive sexual behavior disorder. excessive sexual behavior. Compulsive sexual behavior is sometimes called hypersexuality or sexual addiction. It's an intense focus on sexual fantasies, urges or behaviors that can't be controlled. This causes distress and problems for your health, job, relationships or other parts of your life. CSBD is characterized by repetitive, poorly controlled engagement in sexual impulses, urges, and behaviors (e.g., pornography use). For a diagnosis of CSBD, these sexual behaviors should result in clinically significant distress, neglect of responsibilities, interests, and health, and cause significant impairment in critical areas of functioning. Notably, people with CSBD derive little or no satisfaction from their sexual activities and often make unsuccessful efforts to reduce or stop their behavior. Compared to Asexual – A term used to describe someone who does not experience sexual attraction toward individuals of any gender. Asexuality is a sexual orientation, and is different from celibacy, in that celibacy is the choice to refrain from engaging in sexual behaviors and does not comment on one’s sexual attractions. An asexual individual may choose to engage in sexual behaviors for various reasons even while not experiencing sexual attraction. Asexuality is an identity and sexual orientation; it is not a medical condition. Sexual attraction is not necessary for a person to be healthy. Gray-A, gray-asexual, gray-sexual are terms used to describe individuals who feel as though their sexuality falls somewhere on the spectrum of sexuality between asexuality and sexuality. Demisexual individuals are those who do not experience primary sexual attraction but may experience secondary sexual attraction after a close emotional connection has already formed.",
        "upvotes": 1
    },
    {
        "author": "loyalsubjectbeliever • 4d ago",
        "content": "Or you know what? Even better, explain to me why it belongs in lgbtq. Because arguing without being open about the possibility of being wrong is stupid. Here's my point as to why if it belongs then so does hypersexuality and vice versa: When we think about, for example, a gay man, we're thinking of someone who doesn't simply feel sexually attracted to other men, there's romantic attraction too. It's not just about sexual desire. When it comes to asexuality or hypersexuality the attraction, romantic or sexual, is completely irrelevant. An asexual person and a hypersexual person can be either straight or not. They can be cis or not. I'm pretty confident about this last part because I have acquaintances of both types. You say asexuality belongs to lgbtq, OK. Then why wouldn't hypersexuality? In this thread some say that it's just a mental disorder and to that I have a couple of counter arguments, the first one being that some people were hypersexual from a very young age, before any trauma. I have a close friend like this, so in this case too I feel pretty confident in what I'm saying. The other counter argument is that asexuality was considered a disorder not too long ago too. Same with other categories that belong to the lgbtq community. So, please explain to me why you believe that I'm wrong. My point is not: asexuals don't belong to lgbtq PERIOD. My point is: if hypersexuality doesn't belong then neither should asexuality because they are two faces of the exact same medal.",
        "upvotes": 0
    }
]